Revit 2027 API
AssetPropertyList.AddNewAssetAsColor Method
 Adds a new AssetPropertyDouble4 property to the list containing a value matching the input color.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddNewAssetAsColor(
	Color value
)
Public Sub AddNewAssetAsColor (
	value As Color
)
public:
void AddNewAssetAsColor(
	Color^ value
)
member AddNewAssetAsColor :
        value : Color -> unit
Parameters
value Color
 The color value to add.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The asset property is not editable.
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace